//**1. Перевірте, що першим символом є літера А
// Якщо так, виведіть "так", якщо ні, виведіть "ні" */
// const str = "absde";
// if (str[0]==='a') {
//     console.log('так');
    
// } else {
//     console.log('ні');
    
// }

// console.log(str.startsWith('a') ? 'так' : 'ні');

/**2. Написати скрипт, який перевіряє, чи введене число через ... потрапляє в діапазон
// від 55 до 99 включно
// якщо так, вивести в консоль "Число потрапляє в діапазон"
// Якщо ні, вивести "Число не потрапляє в діапазон" */
// const num = 55;
// if (num >=55 && num <=99 ) {
//     console.log("Число потрапляє в діапазон");
// } else {
//     console.log("Число не потрапляє в діапазон");
// }
// console.log(num >=55 && num <=99 ? 'Число потрапляє в діапазон' : 'Число не потрапляє в діапазон');

/**3. Є три вікові групи - діти (0-16), дорослі (17-60),  пенсіонери (61-100)
 * Визнач, до якої вікової групи належить Максим, якщо його вік 55 років. Назву групи вивести на екран.
*/
// const ageMaksim = 101;
// if (ageMaksim >=0 && ageMaksim <=16) {
//    console.log("діти");
    
// }
// else if (ageMaksim >=17 && ageMaksim <=60) {
//    console.log("дорослі");
    
// }
// else if (ageMaksim >=61 && ageMaksim <=100){
//     console.log("пенсіонери");
// }
// else {
//     console.log("Ти скоро народишся знов -:)");
    
// }

/**4. Напишіть у консоль числа від max до min за спаданням
 * Додати усі парні числа від min до max.
*/
// const min = 110;
// const max = 120;
// let sum =0;
// for (let i = max; i > min; i--) {
//    console.log(i);
//     if (i % 2 !== 0) {
//     continue;
//     }
//     sum += i;
//     console.log("Парні числа", i);
// }
// console.log(sum);

/**5. Запитай користувача у модальному вікні, який із напоїв він бажає придбати - 
 * "Чай", "Каву", або "Сік".
 * Залежно від напою оголоси суму до сплати, використовуй switch.
*/
// const drink = prompt("Оберіть напій");
// function orderDrink(drink) {
//     let price = 0;
//     switch (drink) {
//         case "Кава":
//             price = 60;
//             break
//         case "Чай":
//             price = 30;
//             break
//         case "Сік":
//             price = 50;
//             break
//         default:
//             alert("Doesn't exist")
//             break
//     }
//     return alert(`sum: ${price}грн`)
    
// }
// orderDrink(drink);